[
    {
        "title": "Gabe Reed's Letter",
        "description": "This document details the reasons why the author and their spouse left the International Christian Churches/SoldOut Discipling Movement. They cite doctrinal deviations from Scripture and a concern for the movement's future direction as their primary motivations. The author addresses various groups within the ICC, including leaders, evangelists, and members, urging them to carefully examine the movement's teachings and practices. The document is not intended as a personal attack but as a call to return to sound doctrine and biblical principles.",
        "author": "Gabe Reed",
        "link": "gabereedsletter.html"
    },
    {
        "title": "RCW Open Letter to ICC. The Split",
        "description": "An Open Letter to the International Christian Churches (ICC) and Its Central Leadership",
        "author": "RCW",
        "link": "rcwopenletter.html"
    },
    {
        "title": "Rebuke an Elder Publicly",
        "description": "This document is an open letter from Lance Underhill addressing unresolved issues within church leadership, specifically focusing on divisive behavior by Tim Kernan, a World Sector Leader (WSL) in the International Christian Church (ICC). Lance recounts instances of discord, lack of accountability, and hurt caused to several families and leaders, emphasizing the need for biblical correction and unity. He urges church leaders to thoroughly investigate these concerns and encourages transparency, repentance, and adherence to scriptural principles. Lance’s call is for a return to a united, God-centered movement, placing loyalty to God and His Word above allegiance to any individual leader.",
        "author": "Lance Underhill",
        "link": "rebukeanelderpublicly.html"
    },
    {
        "title": "John Causey Exposed.html",
        "description": "This letter details Lance Underhill's experience of coercion, unethical leadership, and mistreatment by John Causey, a leader in the church. Lance recounts how he and his wife, Jasmin, were pressured to rent an uninhabitable property owned by John, only to face retaliation when they raised concerns. The letter exposes patterns of neglect, financial exploitation, and spiritual manipulation within leadership, as well as the lack of accountability among church authorities. Lance calls for transparency, adherence to biblical principles, and an end to leaders prioritizing “the movement” over genuine discipleship and integrity.",
        "author": "Michael Peterson",
        "link": "johncauseyexposed.html"
    }
]
